### [ 데이터 필터링 ]
- 원하는 데이터를 추출하기 위해서 사용하는 방법
- 원하는 데이터 걸러내겠다는 의미
- 다양한 조건 검사 진행 => 비교 검사 : 같다 ==, 같지 않다 !=, 크다 >, 크거나 같다 >=, 작다 <, 작거나 같다 <=

(1) 모듈 로딩 <hr>

In [1]:
import pandas as pd
import numpy as np

(2) 데이터 준비 <hr>

In [2]:
file = "../../DATA/employees.csv"

(3) 데이터 저장 <hr>

In [3]:
empDF = pd.read_csv(file)

(4) 데이터 확인 <hr>

(5) 데이터 필터링

- [문제] employees 데이터에서 이름이 Maria인 데이터만 추출

- bool값으로 구성된 데이터 ==> 불린 인덱싱(Boolean Indexing)

In [12]:
mariaMask = empDF['First Name'] == 'Maria'   
## 브로드 캐스팅 : empDF와 사이즈가 같은데 모든 값이 Maria인 series 생성
type(mariaMask),mariaMask.sum()     ## series type

(pandas.core.series.Series, 6)

In [9]:
empDF[empDF['First Name'] == 'Maria']   ## True에 해당하는 행만 반환
## = empDF.loc[empDF['First Name'] == 'Maria']   =   empDF[mariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

- [문제] employees 데이터에서 연봉이 50000 이상이 데이터 추출

In [15]:
empDF['Salary']>= 50000   ## 인덱스로 사용

0       False
1        True
2        True
3        True
4        True
        ...
996     False
997      True
998      True
999      True
1000    False
Name: Salary, Length: 1001, dtype: bool

In [16]:
empDF[empDF['Salary']>= 50000]  # True인 행만 추출

    First Name  Gender Start Date    Salary   Mgmt          Team
1       Thomas    Male    3/31/96   61933.0   True           NaN
2        Maria  Female        NaN  130590.0  False       Finance
3        Jerry     NaN     3/4/05  138705.0   True       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
..         ...     ...        ...       ...    ...           ...
994     George    Male    6/21/13   98874.0   True     Marketing
995      Henry     NaN   11/23/14  132483.0  False  Distribution
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev
999     Albert    Male    5/15/12  129949.0   True         Sales

[853 rows x 6 columns]

- [문제] employees 데이터에서 성별이 남자이며 연봉이 100000이상인 데이터 조회 출력

In [19]:
GenderMask = empDF['Gender'] == 'Male'

In [20]:
SalaryMask = empDF['Salary'] >= 148000

In [21]:
empDF[GenderMask & SalaryMask]

    First Name Gender Start Date    Salary   Mgmt         Team
4        Larry   Male    1/24/98  101004.0   True           IT
5       Dennis   Male    4/18/87  115163.0  False        Legal
12     Brandon   Male    12/1/80  112807.0   True           HR
13        Gary   Male    1/27/08  109831.0  False        Sales
17       Shawn   Male    12/7/86  111737.0  False      Product
..         ...    ...        ...       ...    ...          ...
979     Ernest   Male    7/20/13  142935.0   True      Product
981      James   Male    1/15/93  148985.0  False        Legal
983       John   Male   12/23/82  146907.0  False  Engineering
992    Anthony   Male   10/16/11  112769.0   True      Finance
999     Albert   Male    5/15/12  129949.0   True        Sales

[176 rows x 6 columns]

- 여러 개의 조건이 모두 True여야만 하는 조건 ==> AND 조건 (&)
    * 문 법 : 조건1 & 조건2 & 조건3 &...& 조건N
    * 연산자 : & 앰퍼센트
    * 결 과 : True / False

In [28]:
mask = ( (empDF['Gender'] == 'Male') & (empDF['Salary'] >= 148000) )
type(mask), mask.sum()  ## type : series

(pandas.core.series.Series, 5)

In [24]:
empDF[mask]

    First Name Gender Start Date    Salary   Mgmt         Team
4        Larry   Male    1/24/98  101004.0   True           IT
5       Dennis   Male    4/18/87  115163.0  False        Legal
12     Brandon   Male    12/1/80  112807.0   True           HR
13        Gary   Male    1/27/08  109831.0  False        Sales
17       Shawn   Male    12/7/86  111737.0  False      Product
..         ...    ...        ...       ...    ...          ...
979     Ernest   Male    7/20/13  142935.0   True      Product
981      James   Male    1/15/93  148985.0  False        Legal
983       John   Male   12/23/82  146907.0  False  Engineering
992    Anthony   Male   10/16/11  112769.0   True      Finance
999     Albert   Male    5/15/12  129949.0   True        Sales

[176 rows x 6 columns]

- 여러 개의 조건 중 하나가 True면 True가 되는 조건 ==> OR 조건 (|)
    * 문 법 : 조건1 | 조건2 | 조건3 | ...| 조건N
    * 연산자 : | 파이프
    * 결과 : Ture / False

- [문제] employees 데이터에서 입사일이 1993년 1월 1일 이전이거나 또는 팀이 없는 사람 데이터 조회

In [36]:
mask = (empDF['Mgmt'] == False) | (empDF['Start Date'] < '1993-01-01')

In [41]:
pd.to_datetime(empDF['Start Date'])    ## datetime으로 변환

C:\Users\kdp\AppData\Local\Temp\ipykernel_18664\163228064.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.to_datetime(empDF['Start Date'])

0      1993-08-06
1      1996-03-31
2             NaT
3      2005-03-04
4      1998-01-24
          ...
996    1984-01-31
997    2013-05-20
998    2013-04-20
999    2012-05-15
1000          NaT
Name: Start Date, Length: 1001, dtype: datetime64[ns]

In [37]:
empDF[mask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
8       Angela  Female   11/22/05   95570.0   True   Engineering
11       Julie  Female   10/26/97  102508.0   True         Legal
..         ...     ...        ...       ...    ...           ...
992    Anthony    Male   10/16/11  112769.0   True       Finance
995      Henry     NaN   11/23/14  132483.0  False  Distribution
996    Phillip    Male    1/31/84   42392.0  False       Finance
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev

[640 rows x 6 columns]

In [42]:
(empDF['Team'] == 'Sales')|(empDF['Team'] == 'Legal')|(empDF['Team'] == 'Marketing')

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

In [43]:
empDF['Team'].isin(['Sales','Legal','Marketing'])

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

- 구간 지정 검사 불린 메서드 => DF.between(low,high)

In [44]:
(empDF['Salary'] >= 80000) & (empDF['Salary'] < 90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [45]:
empDF['Salary'].between(80000,90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [46]:
empDF['First Name'].str.upper()    ## str : 지시자 / 해당 타입일때 함수와 연결해주는 것

0       DOUGLAS
1        THOMAS
2         MARIA
3         JERRY
4         LARRY
         ...
996     PHILLIP
997     RUSSELL
998       LARRY
999      ALBERT
1000        NaN
Name: First Name, Length: 1001, dtype: object